let names = [
  [
    ['куры', 'гуси', 'павлины'],
    ['сокол', 'орел', 'соловей'],
    ['собака', 'кошка']
  ],
  [
    ['собака', 'кошка'],['собака', 'кошка'],['собака', 'кошка'],['собака', 'кошка'],['собака', 'кошка'],['собака', 'кошка'],['собака', 'кошка'],['собака', 'кошка'],['собака', 'кошка'],
    ['обезьяна', 'рысь']
  ],
  [['пингвин']],
  [['пингвин']]
];


for (a=0; a<=names.length; a++) {
	let inlength = names[a].length;
for (q=0; q<inlength; q++) {
for(let i of names[a][q]){
document.write(i + ' ');
//console.log(i);
}
}}